# Pandas

    -고수준의 데이터 분석, 데이터 처리 등을 쉽게 하기 위해 만들어진 파이썬 패키지
    -보다 안정적으로 대용량 데이터들을 쉽게 처리할 수 있음

1. pandas 라이브러리 불러오기 (import pandas as pd)
2. 데이터 불러오기(df=pdm.read_csv('파일위치'),sep='분리기준')
3. 데이터 출력 print(df)
4. 자료형 확인하기 type(df)->자료형 확인 메소드(시리즈 or데이터 프레임)
5. 행과 열 크기 확인하기 df.shape
6. 컬럼 이름 확인하기 df.columns

# Series: 일련의 객체를 담을 수 있는 1차원 배열 같은 자료 구조 
    Value와 index형태를 지님 
    x=Series(value값,index=[],열방향 순서대로 나열, 숫자는 순서를 나타냄)

In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [2]:
fruit= Series([2500,3800,1200,6000],index=['apple','banana','peer','cherry'])
print(fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [3]:
##value, index
fruit= Series([2500,3800,1200,6000],index=['apple','banana','peer','cherry'])
print(fruit.values)
print(fruit.index)

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [4]:
#value와 index 지정하기
fruit= Series([2500,3800,1200,6000],index=['apple','banana','peer','cherry'])
fruit.name='fruitPrice'
fruit.index.name='fruitName'
print(fruit)

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

# DataFrame: 여러개의 딕셔너리를 처리하는데 있어 Series보다 보기 편한 형태로 제공 
    - 표같은 스프레드시트 형식의 자료구조로 여러개의 칼럼이 있는데 각 칼럼은 
    서로 다른 종류의 값(문자열,숫자, 불리언 등)을 담을 수 있다. 
    - 데이터를 2차원 형식으로 저정

#참고\ 
딕셔너리 만들기/ dict:dictionary 만들기

In [5]:
dic= dict(one=1,two=2)
print(dic)

{'one': 1, 'two': 2}

In [6]:
#딕셔너리 추가할때 
#dic[추가하고 싶은 컬럼인덱스]= valu스값
#  =>  위처럼 치면 딕셔너리 모양인 {a:1}처럼 나온다.

In [7]:
dic= dict(one=1)
dic['two']=2
print(dic)

{'one': 1, 'two': 2}

In [8]:
#데이터 프레임1
df1=DataFrame(np.arange(9).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
df1
#np.arange(총 value 갯수).reshape(행,열)

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [9]:
#columns 열 방향의 index의 순서를 지정해줍니다.
fruitDate = {'fruitName':['apple','banana','cherry','peer'],
            'fruitPrice':[2500,3800,1200,6000],
            'num':[10,5,3,8]}
fruitFrame=DataFrame(fruitDate, columns=['fruitPrice','num','fruitName'])
fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        1200    3    cherry
3        6000    8      peer

In [10]:
#버전 출력
print('pdver=',pd.__version__)

pdver= 0.25.1

딕셔너리의 주요 method

In [11]:
dir(pd)

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [12]:
sel_fruitName = fruitFrame['fruitName']
sel_fruitName#이렇게 안치구 이어서 쳐도됨 밑에꺼처럼

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [13]:
sel_fruitName = fruitFrame['fruitName'];sel_fruitName

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [14]:
#컬럼 추가하기 
#추가하고 싶은 컬럼을 데이터 프레임에 추가[]
fruitFrame['year']=2016;fruitFrame

   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        1200    3    cherry  2016
3        6000    8      peer  2016

In [15]:
#컬럼과 시리즈 넣기
variable =Series([4,2,1],index=[0,2,3])
fruitFrame['stock']=variable
fruitFrame

   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        1200    3    cherry  2016    2.0
3        6000    8      peer  2016    1.0

In [16]:
#Series(value,index)
#Series data row삭제하기: drop()

In [17]:
fruit=Series([2500,3800,1200,6000],index=['apple','banana','cherry','peer'])
new_fruit=fruit.drop('banana')
print(fruit)
print(new_fruit)

apple     2500
banana    3800
cherry    1200
peer      6000
dtype: int64
apple     2500
cherry    1200
peer      6000
dtype: int64

In [18]:
#DataFrame row삭제하기 drop()
fruitData = {'fruitName':['apple','banana','cherry','peer'],
            'fruitPrice':[2500,3800,6000,1200],
            'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame=DataFrame(fruitData,index=fruitName,columns=['fruitPrice','num']) 
fruitFrame2=fruitFrame.drop(['apple','cherry'])
print(fruitFrame)
print('-'*40)
print(fruitFrame2)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
----------------------------------------
        fruitPrice  num
banana        3800    5
peer          1200    8

In [19]:
#df.drop(self,axis,inplace)
fruitFrame3=fruitFrame.copy()
aa=['num']
fruitFrame3.drop(aa,axis=1,inplace=False)#inplace는 가동하다라는 뜻!
#axis=1을 통해 열방향 데이터를 지운다. inplace=True를 해줘야 컬럼이 지워짐
print(fruitFrame)
print('-'*40)
print(fruitFrame3)

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
----------------------------------------
        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [20]:
#axis=0 row(행) 방향으로 합산, 1차원 데이터
#axis=1 column(열) 방향으로 합산,2차원 데이터 
#axis=2 모든 column의 depth가 가진 값 축소,3차원(tensor)데이터

In [21]:
#Series slice
fruit=Series([2500,3800,1200,6000],index = ['apple','banana','peer','cherry'])
fruit['apple':'peer']#시작점: 끝점

apple     2500
banana    3800
peer      1200
dtype: int64

In [22]:
#DataFrame의 Slice
fruitData = {'fruitName':['apple','banana','cherry','peer'],
            'fruitPrice':[2500,3800,6000,1200],
            'num':[10,5,3,8]}
fruitName=fruitData['fruitName']
fruitFrame = DataFrame(fruitData,index = fruitName,columns=['fruitPrice','num'])
#인덱스 안에 리스트 
print(fruitFrame)
print("-"*40)
#print(fruitFrame['fruitPrice'])
#print('-'*40)
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
----------------------------------------

        fruitPrice  num
apple         2500   10
banana        3800    5

In [23]:
#Series의 연산 
fruit1=Series([5,9,10,3],index=['apple','banana','cherry','peer'])
fruit2 = Series([3,2,9,5,10],index=['apple','orange','banana','cherry','mango'])
print(fruit1)
print(fruit2)
fruit1+fruit2

apple      5
banana     9
cherry    10
peer       3
dtype: int64
apple      3
orange     2
banana     9
cherry     5
mango     10
dtype: int64

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

#상관관계와 공분산
german=pd.read_csv('http://freakonometrics.free.fr/german_credit.csv')
german_sample=german[['Duration of Credit (month)','Credit Amount','Age (years)']]
german_sample.corr()

# GroupBy를 이용한 계산 및 요약통계
Series of columns mapping: 값을 하나로 묶어 통계또는 집계결과를 얻기위해 사용 
pd.DataFrame.groupby(그룹명)
기본적으로 그룹라벨이 index가 됩니다. !
index를 사용하고 싶지 않을 경우에는 as_index=False 를 지정

In [24]:
df = pd.DataFrame({
    'city': ['부산', '부산', '부산', '부산', '서울', '서울', '서울'],
    'fruits': ['apple', 'orange', 'banana', 'banana', 'apple', 'apple', 'banana'],
    'price': [100, 200, 250, 300, 150, 200, 400],
    'quantity': [1, 2, 3, 4, 5, 6, 7]})
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [25]:
#평균값 구하기 
df.groupby('city').mean()

      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0

In [26]:
#그룹 여러개 지정하기 :리스트를 통해 그룹을 두개 이상으로 지정하기
#df.groupby(리스트)
df.groupby(['city','fruits']).mean()

             price  quantity
city fruits
부산   apple   100.0       1.0
     banana  275.0       3.5
     orange  200.0       2.0
서울   apple   175.0       5.5
     banana  400.0       7.0

# Groupby object 특성 
df.groupby(그룹명).get_group(그룹데이터):그룹안에 데이터를 사용하고 싶은 경우 사용

In [27]:
df.groupby('city').get_group('부산')

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4

df.groupby().size(): 각 그룹의 사이즈를 취득할 수 있음\
    1차원 배열 오브젝트로 반환

In [28]:
df.groupby('city').size()

city
부산    4
서울    3
dtype: int64

df.groupby().agg():aggregation,집합\
    그룹별로 결과를 얻는 조작

In [29]:
df.groupby('city').agg(np.mean)# 각 지역별로 value를 묶어서 볼 수 있다.

      price  quantity
city
부산    212.5       2.5
서울    250.0       6.0

In [30]:
#평균과 합계를 동시에 구하고 싶은 경우
def my_mean(s):
    return np.mean(s)
df.groupby('city').agg({'price':my_mean,'quantity':np.sum})

      price  quantity
city
부산    212.5        10
서울    250.0        18

# 함수 적용과 매핑

apply():agg 보다 활용하기 편리한 결과를 만들고 싶을 떄 사용
    
        -그룹별로 DataFrame을 사용할 수 있습니다. 
        -groupby로 작성한 label이 row index 가 됨

In [31]:
df.groupby(['city', 'fruits'], 
           as_index=False).apply(lambda d: (d.price * d.quantity).sum())

city  fruits
부산    apple      100
      banana    1950
      orange     400
서울    apple     1950
      banana    2800
dtype: int64

In [32]:
#칼럼중에 하나를 인덱스로 설정
df.set_index('fruits')
df

  city  fruits  price  quantity
0   부산   apple    100         1
1   부산  orange    200         2
2   부산  banana    250         3
3   부산  banana    300         4
4   서울   apple    150         5
5   서울   apple    200         6
6   서울  banana    400         7

In [33]:
#df.isnull(): df표 형식에 True,False 가 들어가있다. 
df.isnull().sum()#null 값의 총 갯수

city        0
fruits      0
price       0
quantity    0
dtype: int64

# 함수 적용과 매핑